app/controllers/api/docs_controller.rb

INSERT INTO "documents" ("content_markdown", "created_at", "provenance_spans", "seed_claimed_at", "seed_markdown", "seed_state", "slug", "title", "updated_at", "yjs_state") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?) RETURNING "id"
---
    def create
      content = params[:content].presence
      requested_format = request.request_parameters["format"].presence
      format = requested_format || "markdown"
      if requested_format && content.blank?
        return render json: { error: "content is required when format is provided." },
                      status: :unprocessable_entity
      end
      unless Document::CONTENT_FORMATS.include?(format)
        return render json: { error: "format must be markdown or html." },
                      status: :unprocessable_entity
      end
      return if reject_oversized_content(content)

      source, normalized, warning = normalized_source_and_signal(format, content, fallback: Document::DEFAULT_SEED)
      kind, name = agent_seed_attribution(content)
      doc = Document.create!(
        title: params[:title].presence || "Untitled",
        content_format: format,
        seed_content: source,
        seed_author_kind: kind,
        seed_author_name: name,
        user: current_api_user,
        owner_name: current_api_user&.name
      )