app/controllers/api/events_controller.rb

    def pending
      presence, = AgentPresence.touch!(document:, agent_name: current_agent)
      events = document.activities
                       .where("id > ?", presence.last_event_id)
                       .where.not(actor_name: current_agent)
                       .order(:id)
                       .limit(100)

      render json: {
        events: events.map(&:as_props),
        ack_with: events.last&.id,
        how_to_ack: "POST #{request.base_url}/api/docs/#{document.slug}/events/ack with {\"last_event_id\": <ack_with>}"
---
UPDATE "agent_presences" SET "last_seen_at" = ?, "updated_at" = ? WHERE "agent_presences"."id" = ?  [["last_seen_at", "2026-06-05 17:18:40"], ["updated_at", "2026-06-05 17:18:40"], ["id", 1]]
UPDATE "documents" SET "yjs_state" = ?, "seed_state" = ?, "updated_at" = ? WHERE "documents"."id" = ?  [["yjs_state", "<56 bytes of binary data>"], ["seed_state", "seeded"], ["updated_at", "2026-06-05 17:26:22.632888"], ["id", 1]]
SELECT "activities".* FROM "activities" WHERE "activities"."document_id" = ? AND (id > ?) AND "activities"."actor_name" != ? ORDER BY "activities"."id" ASC LIMIT ?  [["document_id", 1], [nil, 2], ["actor_name", "Scout"], ["LIMIT", 100]]
SELECT "activities".* FROM "activities" WHERE "activities"."document_id" = ? ORDER BY "activities"."created_at" DESC LIMIT ?  [["document_id", 1], ["LIMIT", 50]]

    def ack
      last_event_id = Integer(params.require(:last_event_id), exception: false)
      if last_event_id.nil?
        return render json: { error: "last_event_id must be an integer." }, status: :unprocessable_entity
      end

      presence, = AgentPresence.touch!(document:, agent_name: current_agent)
---
UPDATE "agent_presences" SET "last_seen_at" = ?, "updated_at" = ? WHERE "agent_presences"."id" = ?  [["last_seen_at", "2026-06-05 17:18:30.180677"], ["updated_at", "2026-06-05 17:18:30.180815"], ["id", 1]]
UPDATE "documents" SET "yjs_state" = ?, "seed_state" = ?, "updated_at" = ? WHERE "documents"."id" = ?  [["yjs_state", "<29 bytes of binary data>"], ["seed_state", "seeded"], ["updated_at", "2026-06-05 17:26:22.628930"], ["id", 1]]