app/controllers/api/presences_controller.rb

    def create
      status = params[:status].presence_in(%w[active done]) || "active"
      _presence, newly_arrived = AgentPresence.touch!(
        document:,
        agent_name: current_agent,
        status:,
        location_text: params[:location].presence
      )

      if newly_arrived
        Activity.log!(
          document:, actor_name: current_agent, actor_kind: "agent",
          action: "joined", detail: "announced presence"
        )
      elsif status == "done"
        Activity.log!(
          document:, actor_name: current_agent, actor_kind: "agent",
          action: "left", detail: "signed off"
        )
      end

      render json: {
        presence: { agent_name: current_agent, status: },
        agents_present: document.agent_presences.active.map(&:as_props)
---
UPDATE "agent_presences" SET "last_seen_at" = ?, "status" = ?, "updated_at" = ? WHERE "agent_presences"."id" = ?  [["last_seen_at", "2026-06-05 17:18:30.161119"], ["status", "done"], ["updated_at", "2026-06-05 17:18:30.161489"], ["id", 1]]
UPDATE "documents" SET "yjs_state" = ?, "seed_state" = ?, "updated_at" = ? WHERE "documents"."id" = ?  [["yjs_state", "<109 bytes of binary data>"], ["seed_state", "seeded"], ["updated_at", "2026-06-05 17:18:36.966304"], ["id", 1]]
SELECT "agent_presences".* FROM "agent_presences" WHERE "agent_presences"."document_id" = ? AND "agent_presences"."agent_name" = ? LIMIT ?  [["document_id", 1], ["agent_name", "Scout"], ["LIMIT", 1]]