app/channels/sync_channel.rb

SELECT "documents".* FROM "documents" WHERE "documents"."slug" = 'demo' LIMIT 1
---
  def subscribed
    @document = Document.find_by(slug: params[:slug])

UPDATE "documents" SET "seed_state" = 'claimed', "seed_claimed_at" = '2026-06-05 16:48:59.745144' WHERE "documents"."id" = 1 AND (seed_state = 'pending' OR (seed_state = 'claimed' AND seed_claimed_at < '2026-06-05 16:48:29.745088'))
---
  def claim_seed?
    return false if @document.yjs_state.present? || @document.seed_markdown.blank?

    Document
      .where(id: @document.id)
      .where(
        "seed_state = 'pending' OR (seed_state = 'claimed' AND seed_claimed_at < ?)",
        SEED_CLAIM_TIMEOUT.ago
      )
      .update_all(seed_state: "claimed", seed_claimed_at: Time.current) == 1