app/controllers/ai_suggestions_controller.rb

SELECT "documents".* FROM "documents" WHERE "documents"."slug" = ? LIMIT ?  [["slug", "76PdK5icd8"], ["LIMIT", 1]]
---
  def create
    document = Document.find_by!(slug: params[:slug])