app/controllers/comments_controller.rb

  def create
    document = Document.find_by!(slug: params[:slug])
---
SELECT "documents".* FROM "documents" WHERE "documents"."slug" = ? LIMIT ?  [["slug", "p6FXpxFq5f"], ["LIMIT", 1]]

  def resolve
    comment = Comment.find(params[:id])
---
SELECT "comments".* FROM "comments" WHERE "comments"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]