app/controllers/documents_controller.rb

  def show
    document = Document.find_by!(slug: params[:slug])

    # Read's canonical URL is the bare document path. /read is routable only
    # so a hand-edited or agent-guessed mode URL canonicalizes instead of
    # 404ing next to its routable /edit|/suggest|/comment siblings.
    if params[:mode] == "read"
      return redirect_to document_page_path(document.slug), status: :moved_permanently
    end

    link_preview_request = link_preview_user_agent?
    mode = requested_document_mode(document)

    # Mode URLs express an editing capability. If the current viewer cannot
    # use that capability, send them to the canonical Read URL before the
    # request can affect recents or claim a pending seed. The demo is the one
    # intentionally fixed-mode document: it remains Edit at its established
    # base URL, so alternate demo URLs canonicalize there too.
    if params[:mode].present? &&
       (document.slug == "demo" || !document_mode_available?(document, mode))
---
SELECT "documents".* FROM "documents" WHERE "documents"."slug" = ? LIMIT ?  [["slug", "kCoWoiw4Ew"], ["LIMIT", 1]]
SELECT 1 AS one FROM "documents" WHERE "documents"."slug" = ? LIMIT ?  [["slug", "f5zheXRoA6"], ["LIMIT", 1]]

          editable: preview_editable,
          sketch_interactive: preview_sketch_interactive
        )
        document.slice(:id, :slug, :title, :content_format).merge(
        # Only the client that won the seed claim applies the template; on
        # every other load (every load of a live document) the seed is dead
        # weight the size of the document, so it rides with the grant only.
        seed_content: (document.seed_content if seed_granted),
        seed_version: document.updated_at.iso8601(6),
        seed_granted: seed_granted,
        seed_author_kind: document.seed_author_kind,
        seed_author_name: document.seed_author_name,
        has_state: document.yjs_state.present?,
        yjs_state_b64: embedded_yjs_state_b64(document),
        # Server-rendered prose for an instant first paint; the live editor
        # swaps in over it once Milkdown binds the hydrated Yjs state. The
        # block count lets the preview adopt the long-document rendering the
        # editor will use, so the two layers keep the same geometry.
        content_html:,
        content_blocks: DocumentPreviewHtml.block_count(content_html),
        # Client-measured render geometry (Mermaid figure heights) persisted
        # from earlier snapshots; the editor pre-sizes its diagram figures from
        # the same hints the preview skeletons used, so neither layer jumps
        # when mermaid finishes rendering.
---
UPDATE "documents" SET "yjs_state" = ?, "seed_state" = ?, "updated_at" = ? WHERE "documents"."id" = ?  [["yjs_state", "<146 bytes of binary data>"], ["seed_state", "seeded"], ["updated_at", "2026-06-05 17:26:22.640621"], ["id", 1]]

      )
      },
      # Ownership rides its own lazy prop so claim events reload cheaply —
      # never re-shipping the Yjs state embedded in the document prop above.
      ownership: -> { document.ownership_props(owner_token, viewer_user: current_user) },
      suggestions: -> { document.suggestions.pending.order(:created_at).map(&:as_props) },
      comments: -> { document.comments.order(:created_at).map(&:as_props) },
      activities: -> { document.activities.recent.map(&:as_props) },
      presences: -> { document.agent_presences.active.map(&:as_props) },
      highlight_names: -> { document.highlight_names || {} },
      # Compound writing lives in Comment mode for featured accounts only:
---
SELECT "comments".* FROM "comments" WHERE "comments"."document_id" = ? ORDER BY "comments"."created_at" ASC  [["document_id", 1]]