app/controllers/documents_controller.rb

SELECT "documents".* FROM "documents" WHERE "documents"."slug" = 'demo' LIMIT 1
---
  def index
    # Your docs: claimed by this browser's ownership token, newest first.
    yours = Document.where(owner_token: owner_token).order(created_at: :desc).limit(50)
    your_slugs = yours.map(&:slug).to_set