app/controllers/suggestions_controller.rb

  def set_suggestion
    @suggestion = Suggestion.find(params[:id])
---
SELECT "suggestions".* FROM "suggestions" WHERE "suggestions"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]